In [17]:
import pandas as pd
from pyspark.sql import SparkSession
import boto3
import os 
import pyspark.sql.functions as sql_func

In [ ]:
spark.stop()

In [13]:

spark = SparkSession \
.builder \
.getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).

22/11/25 17:26:45 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [25]:
df_population = spark.read.csv('temperature_state.csv', sep=';', header='true')

In [26]:
df_population.head()

Row(date_time='1855-05-01', avg_temperature='25.544', state_name='Acre', country_name='Brazil')

In [29]:
df_population.withColumn("country_name_partition",sql_func.col("country_name")).write.mode('overwrite').partitionBy("country_name_partition").parquet("temperature_state.parquet")

In [1]:
import boto3
import os

In [3]:


s3 = boto3.resource(
    service_name='s3',
    region_name='us-west-2',
    aws_access_key_id='',
    aws_secret_access_key=''
)

In [4]:
s3 = boto3.resource('s3')
bucket = s3.Bucket('data-climate')

In [5]:
for object_summary in bucket.objects.filter(Prefix=""):
    print(object_summary.key)

country.csv
country.zip
temperature_country.csv
temperature_country.zip

In [6]:
import pandas as pd

In [7]:
df = pd.read_csv('temperature_state.csv', delimiter=';')

In [8]:
df.head()

    date_time  avg_temperature state_name country_name
0  1855-05-01           25.544       Acre       Brazil
1  1855-06-01           24.228       Acre       Brazil
2  1855-07-01           24.371       Acre       Brazil
3  1855-08-01           25.427       Acre       Brazil
4  1855-09-01           25.675       Acre       Brazil

In [11]:
for item in df['country_name'].unique():
    df_country = df[df['country_name']==item]

    df_country.to_json('temperature_state_{}.json'.format(item))

In [30]:
df= pd.read_parquet('test.parquet')
df

       date_time avg_temperature         state_name country_name
0     1926-10-01            23.4  Western Australia    Australia
1     1926-11-01          26.915  Western Australia    Australia
2     1926-12-01          26.888  Western Australia    Australia
3     1927-01-01          28.087  Western Australia    Australia
4     1927-02-01          27.615  Western Australia    Australia
...          ...             ...                ...          ...
1039  2013-05-01          19.915  Western Australia    Australia
1040  2013-06-01          16.176  Western Australia    Australia
1041  2013-07-01          15.745  Western Australia    Australia
1042  2013-08-01          18.337  Western Australia    Australia
1043  2013-09-01            None  Western Australia    Australia

[1044 rows x 4 columns]